["山西省吕梁市离石区滨河南东路东延100米", "山西省晋城市城区泽州南路与白水街交汇处", "山西省运城经济开发区涑水街与安中路交会处", "昌盛街与坞城南路交叉口居然之家坤泽店", "太原市万柏林区迎泽西大街332号", "乌兰察布市集宁新区数码大厦裙楼", "武汉市江汉区常青路45号居然之家汉口店", "呼和浩特市玉泉区昭君路与南二环交汇处南200米路西居然之家广场", "呼和浩特市新城区兴安北路169号", "北京市朝阳区北四环东路65号", "长春市宽城区辽宁路772号", "北京市朝阳区十八里店乡周庄村108号", "北京市丰台区南三环西路58号", "北京市海淀区远大路1号", "北京市丰台区西三环南路甲27号", "北京市大兴区黄村镇枣园路8号，地铁4号线枣园站C口向东100米即到。", "北京市顺义区顺西北路乙22号", "河北省沧州市新华区黄河东路82号", "河北省邢台市桥西区中兴西大街与育才路交会处西北角", "河北省秦皇岛市华山北路19号", "河北省邯郸市邯山区浴新南大街与学院北路交叉口隆基泰和广场", "石家庄市长安区光华路321号居然之家", "山西省晋中市榆次区迎宾西街区政府旁", "北京市石景山区阜石路168号（沃尔玛山姆会员店对面）", "襄阳市高新区长虹北路与邓城大道交汇处", "内蒙古通辽市河西创业大道与阿 古拉大街交汇处", "湖北省武汉市徐东大街50号居然之家武昌店1层D门", "北京市丰台区西三环南路甲27号居然之家丽泽店5层101", "北京市丰台区西三环南路甲27号居然之家丽泽店5层", "北京市西三环南路甲27号居然之家丽泽体验Mall一层", "北京市西三环南路甲27号居然之家丽泽体验Mall三层西侧", " 北京市周家庄路8号居然靓屋灯饰城5层", " 北京市西三环南路甲27号居然之家丽泽店4楼 ", " 北京市东直门南大街甲三号居然大厦B1层", "北京市丰台区南三环西路58号居然之家玉泉营店一层", "北京市朝阳区北四环东路65号居然之家北四环店5号馆地下一层", "北京市海淀区远大路1号居然之家金源店家具家饰馆一层 ", "北京市朝阳区大羊坊路106号居然之家十里河店家居馆3号门一层", "北京市丰台区西三环南路甲27号居然之家丽泽MALL 4层福康养老小镇", "北京市海淀区远大路1号金源时代购物中心居然之家家居家饰馆一层", "北京市朝阳区北四环东路65号居然之家1号馆一层", "北京市朝阳区十八里店大羊坊路106居然之家家居馆一层4号门", "北京市东城区东直门南大街甲3号居然大厦一层东大厅", "北京市丰台区西三环南路甲27号居然之家一层一号门", "山东省莱阳市龙门西路501号", "山东省临沂市兰山区北城新区上海路与孝河路交汇处东南150米", "山东省滕州市大同路与荆河路交汇处", "山东省威海市经济技术开发区华夏路-18号", "山东省荣成市观海东路98号", "山东省龙口市南山路与龙泉路（牟黄路）交汇处", "山东省淄博市柳泉路与中润大道交会处（火炬大厦北邻）", "山东省青岛市市北区黑龙江南路77号", "包头市民族东路 与文化路口北200米", "山东省枣庄市枣庄高新区祁连山路西侧", "泰安市泰山区龙潭路207号", "济南市天桥区历山北路123号", "长春是经济技术开发区仙台大街1228号赛德广场", "长春市宽城区辽宁路772号", "大同市永泰南路东侧南环路南侧", "福建省泉州市洛江区安吉南路中段", "福建省晋江市梅岭街道碧山社区长兴路601号", "福建省石狮市蚶江镇外东环路南侧益家万博城", "福建省福州市台江区八一七中路与群众路交叉口", "辽宁省海城市光明路5号居然之家", "庄河市延安路南段699号（海洋大桥南行200米）", "遵化市三实小西行1000米路北", "乌兰察布市集宁新区数码大厦裙楼", "河北省霸州市开发区京开路西侧 ", "重庆市璧山区璧青北路870号", "晋城市城区黄华街与白水街交汇处", "山西省朔州市朔城区古北街西延线南侧居然之家", "建材馆：长风街与长治路交叉口西北角 家具馆：长风街与长治路交叉口向南500米", "齐齐哈尔市建华区明海公路108号", "江苏省常州市天宁区和平中路与清凉西路交叉口（和平中路388号）", "无锡市梁溪区锡沪东路1号", "宁夏回族自治区民族南街771号（原光耀美居）", "临汾市开发区河汾路与鼓楼北大街交汇处往西300米", "河北省承德市高新区西区・和润佳汇广场居然之家", "包头市青山区一宫环岛西南角", "内蒙古赤峰市新城区临潢大街西段和美工贸园区", "呼伦贝尔市海拉尔区河东阿里河路交通局北侧", "鄂尔多斯市东胜区天骄南路109辅路居然之家", "巴彦淖尔市金川大道与解放街交汇处西北角", "呼和浩特市玉泉区昭君路与南二环交汇处南200米路西居然之家广场", "山东省潍坊市奎文区玉清东街17100号", "呼和浩特市新城区兴安北路169号", "山西省长治市英雄北路198号", "襄垣县太行路615号", "宜昌市西陵区发展大道与东山四路交汇处", "湖北省黄冈市蕲春县赤东镇李时珍大道688号居然之家蕲春店", "孝感市孝南区北京南路南方国际商城", "湖北武汉市武昌区和平大道793号", "重庆市江北区北滨一路368号", "重庆市九龙坡区迎宾大道33号 ", "重庆市两江新区金开大道1226号附1号（园博园轻轨站旁）", "重庆市渝北区龙山街道红石路150号聚信广场裙楼2幢B2-110", "重庆市涪陵区滨江大道二段52号", "重庆市大足区棠香街道办事处五星大道南段229号", "贵州省毕节市七星关区碧阳大道与德溪路交汇处", "贵州省凯里市迎宾大道12号", "贵州省仁怀市醉美大道181号(惠邦国际城)", "贵州省遵义市红花岗区忠庄立交桥旁", "湖北武汉市武昌区徐东大街50号", "河北省廊坊市香河县绣水街东段路南", "河北省唐山市新华西道7号", "河北省唐山市高新技术开发区建设北路179号", "河北省保定市莲池区东三环与七一路交叉口", "无锡市金城东路18号", "江苏省常州市天宁区中吴大道721号2幢4368号", "南通崇川区钟秀路35号", "江苏省盐城市高新区世纪大道与秦川南路交界处", "徐州市鼓楼区复兴北路189号", "山西省长治市长治县黎都东街 与正大北路交汇处", "天津市武清区前进道与泉发路交口亚平宁广场内", "山西省太原市长风街居然之家建材馆B号门入口处", "天津市滨海新区塘沽福州道与东江路交口贻成福地广场东侧", "天津市河西区解放南路475号", "天津市东丽区津昆桥东北侧", "沈阳市皇姑区黄河南大街38号", "沈阳市浑南新区金卡路16号（奥体中心正对面）", "辽宁省大连市金州区光明街道胜利路1号", "辽宁省大连市甘井子区金三角广场15号", "铁岭市银州区汇工街140号", "盘锦市兴隆台区兴隆大街195号", "辽宁省鞍山市千山区四达路65号", "辽宁省营口市老边区渤海东大街6号", "东港市振兴街8号（六中西行300米）", "辽阳市文圣区天福路36号（新运大桥东）", "河南省郑州市郑东新区商都路6号", "河南省郑州市二七区京广南路46-48号", "河南省郑州市经开区航海东路与前程大道交叉口", "河南省郑州市上街区济源路与金华路交汇处", "河南省郑州市郑东新区农业南路商都路交会处", "河南省郑州市中原区西三环与中原路交汇处西北角", "河南省郑州市二七区航海路与郑密路交汇处东南角", "河南省洛阳市王城大道与九都路交叉口东南角", "河南省新乡市平原路与和平路东北角金谷时代广场（平原路348号）", "河南省信阳市羊山新区新二十四大街与南京路交叉口北200米", "河南省信阳市羊山新区新二十四大街北段欧凯龙家居小镇", "许昌市建安区梨园转盘南100米路西", "平顶山市建设路与凌云路交叉口北500米", "河南省开封市郑开大道与三大街交叉口东南角大宏城市广场1号楼", "河南省洛阳市洛龙区龙门大道与开元大道交叉口", "河南省长垣县崇礼路与淇河路交汇处", "玉林市清宁路与二环北路交汇处(毅德商贸城5号馆）", "广东省佛山市禅城区佛山大道中189号", "新疆维吾尔自治区克拉玛依市胜利路26-1、2、3号", "安徽省合肥市徽州大道与紫云路交口向东100米", "安徽省合肥市瑶海区长江东路628号", "安徽省合肥市长丰县蒙城北路与双墩路交口北城世纪金源购物中心B座居然之家", "安徽省合肥市徽州大道与紫云路交口向东100米", "新疆维吾尔自治区乌鲁木齐市新市区绍兴中街3400号", "广东省阳江市阳东区广雅东路268号", "广东省珠海市香洲区上冲关口华威路33号", "新疆省昌吉市净化路和科二路交汇处富美国际家具建材城内", "安徽省六安市开发区皖西大道188号", "安徽省马鞍山市雨山西路与红旗中路交叉口", "安徽省淮南市田家庵区永安大道北段东侧", "安徽省滁州市南谯路与醉翁路交口中普城市广场", "安徽省芜湖市鸠江区天门山东路68号", "安徽省阜阳市颍州区阜王路与三清路交口", "山东省淄博市临淄区临淄大道与一诺路交叉路口辛华路2188号", "安徽省蚌埠市迎宾大道1399号", "安徽省桐城市同安路与望溪路交口往北500米", "河南省焦作市马村区人民路3888号", "银安街999号", "海南省海口市秀英区滨海大道102号居然之家8层", "青海省西宁市城北区海湖大道99号", "甘肃省庆阳市西峰区兰州东路25号", "甘肃省张掖市甘州区新张掖国际商贸城居然之家张掖店", "甘肃省嘉峪关市镜铁区兰新东路6656号", "天水市麦积区天河南路与马跑泉交汇处（马跑泉广场南侧）", "甘肃省白银市长春路586号", "甘肃省兰州市安宁区北滨河西路1216号居然之家立达店", "兰州市城关区北面滩文理学院向东500米", "高庄镇修高路中段18号（中国原点新城）", "西安市北二环东段908号", "陕西省汉中市汉台区天汉大道东侧、桥北广场北侧", "陕西省咸阳市杨凌区 常青路与高干渠路 十字东北角", "陕西铜川市耀州区药王路东段北侧永乐城市广场1号楼", "陕西省商洛市商州区 商秧大道与惠民一路交汇处", "渭南市富平县南二环西段北侧18号", "陕西省渭南市临渭区东风街41号", "陕西省神木市西沙二路七中对面", "西安市临潼区秦陵北路中段居然之家临潼店", "延安市宝塔区尹家 沟通往新城主干道居然之家", "陕西省宝鸡市 金台区金台大道23号", "陕西省咸阳市秦都区人民西路4号", "咸阳市秦都区文林西路北侧", "航天西路与航天 中路交汇处东北角", "陕西省西安市碑林区南二环东段一号", "陕西省西安市未央区北二环西段明光路口东居然之家中联至尊店", "陕西省西安市雁塔区高新四路9号", "西安市经开区北二环西段明光路西侧", "贵州省贵阳市观山湖区世纪金源购物中心四区", "云南省宣威市文化路7号", "云南省大理州宾川县金牛镇全球通大道居然之家", "云南省保山市腾冲市腾越镇国际商贸城2栋居然之家", "云南省曲靖市麒麟区闽南建材城三期", "昆明市官渡区世纪城金源大道1号中国东盟.云南商品交易中心一区", "四川省绵阳市高新区普明大桥东辰宜家美广场居然之家", "四川省宜宾市宜宾县城北新区仁和路", "四川省广元市利州区雪峰九华岩居然之家", "四川省德阳市旌阳区天元经济开发区青云山路1号恒大建材城1#栋3-1、3-2号", "成都市青羊区苏坡东路8号", "成都市金牛区一品天下大街399号", "四川省成都市三环路琉璃立交旁锦华路86号", "山东省菏泽市牡丹区长江西路777号", "山东省招远市迎宾路1号", "济宁市任城区盛泰广场G座", "山东省潍坊市高密市凤凰大街与曙光路交汇处", "山东省青岛市黄岛区长江东路278号", "辽宁省海城市兴海管理区站前街利民委龙水金帝商业广场", "辽宁省葫芦岛市兴城市兴海北街28号", "辽宁省庄河市延安路699号", "辽宁省锦州市太和区南广路68号", "江西省赣州市开发区东江源大道219号金湾广场", "泰兴市江平北路与阳江路交界处", "怀化市舞阳大道与环城路交汇处西南角（武陵山国际商贸物流城）", "宁乡二环路与文体路交汇处西北角", "醴陵市左权南路与渌江大道交汇处东南角", "长沙市湘江新区普瑞大道与马桥河路交汇处西南角（金桥国际市场集群）", "邵阳市双清区湘桂黔建材城二期（紫薇公园入口旁）", "岳阳市岳阳楼区岳阳大道与白石岭路交汇处东南角", "长沙市开福区世纪金源购物中心北栋", "长沙市雨花区万家丽路与长沙大道交汇处西南角", "天门市竟陵办事处钟惺大道东9号，8号楼08幢东一", "十堰市郧阳区城关镇解放南路19号", "湖北省十堰市茅箭区朝阳中路89号", "襄阳市高新区长虹北路与邓城大道交汇处居然之家襄阳店", "湖北省枣阳市书院街与东环路交汇处", "武汉市武昌区徐东大街50号居然之家武昌店五金涂料超市", "武汉市江汉区常青路常青路45号居然之家家居市场5层", "湖北省武汉市东湖高新技术开发区雄庄路曙光星城D（东）区1-5层", "绥化市北林区绥兰路与康庄路交叉口", "齐齐哈尔市建华区明海公路108号", "哈尔滨市道里区群力大道与兴江路交汇处", "大庆市客运枢纽站 沿世纪大道往哈大高速 方向两公里处", "南岗区哈西大街与学府三道街交口处", "哈尔滨市道里区爱建路17号", "黑龙江省哈尔滨市道外区先锋路471号", "儋州市那大镇蓝洋南路", "海南省文昌市文城镇文昌大道", "海南省三亚市迎宾路东岸村委会北侧YC2-47-1号", "海南省海口市秀英区滨海大道102号居然之家海口店", "北京市朝阳区南四环东路1号"]